Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.kube_wk[0] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-0"
      + network_interface_names = (known after apply)
      + node_name               = "promox"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 550

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + user_data_file_id = "backup-nas:snippets/k3s-cp.cloud-config.yaml"

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.120/32"
                  + gateway = "192.168.2.1"
                }
            }
        }

      + memory {
          + dedicated = 4096
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # module.lxc-k8s-cp1.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "500"
        tags          = []
        # (6 unchanged attributes hidden)

      ~ cpu {
          ~ units        = 1024 -> 2048
            # (2 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated = 1024 -> 2048
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.lxc-k8s-cp2.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "501"
        tags          = []
        # (6 unchanged attributes hidden)

      ~ cpu {
          ~ units        = 1024 -> 2048
            # (2 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated = 1024 -> 2048
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.lxc-k8s-cp3.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "502"
        tags          = []
        # (6 unchanged attributes hidden)

      ~ cpu {
          ~ units        = 1024 -> 2048
            # (2 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated = 1024 -> 2048
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
╷
│ Warning: Redundant empty provider block
│ 
│   on .terraform/modules/lxc-k8s-cp1/proxmox/lxc/data.tf line 1:
│    1: provider "http" {
│ 
│ Earlier versions of Terraform used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "http" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.lxc-k8s-cp1:
│     http = {
│       source = "hashicorp/http"
│       configuration_aliases = [
│         http.github,
│       ]
│     }
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/lxc-k8s-cp1/proxmox/lxc/lxc.tf line 31, in resource "proxmox_virtual_environment_container" "lxc":
│   31:         data.http.github_ssh_key.body
│ 
│ The attribute "body" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c79e3cbba2de:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 1 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`